---
kind: type
id: T:Autodesk.Revit.DB.MeshFromGeometryOperationResult
source: html/acca9a2a-6d1d-efd3-3838-218e2a94f52a.htm
---
# Autodesk.Revit.DB.MeshFromGeometryOperationResult

Describes what TessellatedShapeBuilder has
 built.

## Syntax (C#)
```csharp
public class MeshFromGeometryOperationResult : IDisposable
```